<details ><summary>plan for ruby-getting-started-terraform 2025-12-31 07:52:52 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_scheduler_schedule.stop_rds will be created
  + resource "aws_scheduler_schedule" "stop_rds" {
      + arn                          = (known after apply)
      + description                  = "Stop RDS instance at 23:00 JST daily"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "ruby-getting-started-stop-rds"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 14 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:rds:stopDBInstance"
          + input    = jsonencode(
                {
                  + DbInstanceIdentifier = "ruby-getting-started-mysql"
                }
            )
          + role_arn = "arn:aws:iam::786832920677:role/ruby-getting-started-scheduler-role"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (ruby-getting-started-terraform)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |             RESOURCE              |
|--------|-----------------------------------|
| add    | `aws_scheduler_schedule.stop_rds` |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p ruby-getting-started-terraform
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>